Add training workflows
Signed-off-by: abhijeet-dhumal <abhijeetdhumal652@gmail.com>
